sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_lfss.h
/* LFSS_SPMWPROT7 Bits */
/* LFSS_SPMWPROT7[KEY] Bits */
#define LFSS_SPMWPROT7_KEY_OFS                   (24)                            /* !< KEY Offset */
#define LFSS_SPMWPROT7_KEY_MASK                  ((uint32_t)0xFF000000U)         /* !< need to write (KEY=0xE8) to update
                                                                                    this register */
#define LFSS_SPMWPROT7_KEY_UNLOCK_W              ((uint32_t)0xE8000000U)         /* !< This field must be written with
                                                                                    0xE8 to be update the write protect
                                                                                    bits. */
/* LFSS_SPMWPROT7[WP_31_3] Bits */
#define LFSS_SPMWPROT7_WP_31_3_OFS               (15)                            /* !< WP_31_3 Offset */
#define LFSS_SPMWPROT7_WP_31_3_MASK              ((uint32_t)0x00008000U)         /* !< write protect SPMEM31 - DATA3 */
#define LFSS_SPMWPROT7_WP_31_3_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT7_WP_31_3_READONLY          ((uint32_t)0x00008000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT7[WP_31_2] Bits */
#define LFSS_SPMWPROT7_WP_31_2_OFS               (14)                            /* !< WP_31_2 Offset */
#define LFSS_SPMWPROT7_WP_31_2_MASK              ((uint32_t)0x00004000U)         /* !< write protect SPMEM31 - DATA2 */
#define LFSS_SPMWPROT7_WP_31_2_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT7_WP_31_2_READONLY          ((uint32_t)0x00004000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT7[WP_31_1] Bits */
#define LFSS_SPMWPROT7_WP_31_1_OFS               (13)                            /* !< WP_31_1 Offset */
#define LFSS_SPMWPROT7_WP_31_1_MASK              ((uint32_t)0x00002000U)         /* !< write protect SPMEM31 - DATA1 */
#define LFSS_SPMWPROT7_WP_31_1_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT7_WP_31_1_READONLY          ((uint32_t)0x00002000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT7[WP_31_0] Bits */
#define LFSS_SPMWPROT7_WP_31_0_OFS               (12)                            /* !< WP_31_0 Offset */
#define LFSS_SPMWPROT7_WP_31_0_MASK              ((uint32_t)0x00001000U)         /* !< write protect SPMEM31 - DATA0 */
#define LFSS_SPMWPROT7_WP_31_0_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT7_WP_31_0_READONLY          ((uint32_t)0x00001000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT7[WP_30_3] Bits */
#define LFSS_SPMWPROT7_WP_30_3_OFS               (11)                            /* !< WP_30_3 Offset */
#define LFSS_SPMWPROT7_WP_30_3_MASK              ((uint32_t)0x00000800U)         /* !< write protect SPMEM30 - DATA3 */
#define LFSS_SPMWPROT7_WP_30_3_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT7_WP_30_3_READONLY          ((uint32_t)0x00000800U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT7[WP_30_2] Bits */
#define LFSS_SPMWPROT7_WP_30_2_OFS               (10)                            /* !< WP_30_2 Offset */
#define LFSS_SPMWPROT7_WP_30_2_MASK              ((uint32_t)0x00000400U)         /* !< write protect SPMEM30- DATA2 */
#define LFSS_SPMWPROT7_WP_30_2_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT7_WP_30_2_READONLY          ((uint32_t)0x00000400U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT7[WP_30_1] Bits */
#define LFSS_SPMWPROT7_WP_30_1_OFS               (9)                             /* !< WP_30_1 Offset */
#define LFSS_SPMWPROT7_WP_30_1_MASK              ((uint32_t)0x00000200U)         /* !< write protect SPMEM30 - DATA1 */
#define LFSS_SPMWPROT7_WP_30_1_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT7_WP_30_1_READONLY          ((uint32_t)0x00000200U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT7[WP_30_0] Bits */
#define LFSS_SPMWPROT7_WP_30_0_OFS               (8)                             /* !< WP_30_0 Offset */
#define LFSS_SPMWPROT7_WP_30_0_MASK              ((uint32_t)0x00000100U)         /* !< write protect SPMEM30 - DATA0 */
#define LFSS_SPMWPROT7_WP_30_0_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT7_WP_30_0_READONLY          ((uint32_t)0x00000100U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT7[WP_29_3] Bits */
#define LFSS_SPMWPROT7_WP_29_3_OFS               (7)                             /* !< WP_29_3 Offset */
#define LFSS_SPMWPROT7_WP_29_3_MASK              ((uint32_t)0x00000080U)         /* !< write protect SPMEM29 - DATA3 */
#define LFSS_SPMWPROT7_WP_29_3_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT7_WP_29_3_READONLY          ((uint32_t)0x00000080U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT7[WP_29_2] Bits */
#define LFSS_SPMWPROT7_WP_29_2_OFS               (6)                             /* !< WP_29_2 Offset */
#define LFSS_SPMWPROT7_WP_29_2_MASK              ((uint32_t)0x00000040U)         /* !< write protect SPMEM29 - DATA2 */
#define LFSS_SPMWPROT7_WP_29_2_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT7_WP_29_2_READONLY          ((uint32_t)0x00000040U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT7[WP_29_1] Bits */
#define LFSS_SPMWPROT7_WP_29_1_OFS               (5)                             /* !< WP_29_1 Offset */
#define LFSS_SPMWPROT7_WP_29_1_MASK              ((uint32_t)0x00000020U)         /* !< write protect SPMEM29 - DATA1 */
#define LFSS_SPMWPROT7_WP_29_1_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT7_WP_29_1_READONLY          ((uint32_t)0x00000020U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT7[WP_29_0] Bits */
#define LFSS_SPMWPROT7_WP_29_0_OFS               (4)                             /* !< WP_29_0 Offset */
#define LFSS_SPMWPROT7_WP_29_0_MASK              ((uint32_t)0x00000010U)         /* !< write protect SPMEM29 - DATA0 */
#define LFSS_SPMWPROT7_WP_29_0_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT7_WP_29_0_READONLY          ((uint32_t)0x00000010U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT7[WP_28_3] Bits */
#define LFSS_SPMWPROT7_WP_28_3_OFS               (3)                             /* !< WP_28_3 Offset */
#define LFSS_SPMWPROT7_WP_28_3_MASK              ((uint32_t)0x00000008U)         /* !< write protect SPMEM28 - DATA3 */
#define LFSS_SPMWPROT7_WP_28_3_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT7_WP_28_3_READONLY          ((uint32_t)0x00000008U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT7[WP_28_2] Bits */
#define LFSS_SPMWPROT7_WP_28_2_OFS               (2)                             /* !< WP_28_2 Offset */
#define LFSS_SPMWPROT7_WP_28_2_MASK              ((uint32_t)0x00000004U)         /* !< write protect SPMEM28 - DATA2 */
#define LFSS_SPMWPROT7_WP_28_2_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT7_WP_28_2_READONLY          ((uint32_t)0x00000004U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT7[WP_28_1] Bits */
#define LFSS_SPMWPROT7_WP_28_1_OFS               (1)                             /* !< WP_28_1 Offset */
#define LFSS_SPMWPROT7_WP_28_1_MASK              ((uint32_t)0x00000002U)         /* !< write protect SPMEM28 - DATA1 */
#define LFSS_SPMWPROT7_WP_28_1_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT7_WP_28_1_READONLY          ((uint32_t)0x00000002U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT7[WP_28_0] Bits */
#define LFSS_SPMWPROT7_WP_28_0_OFS               (0)                             /* !< WP_28_0 Offset */
#define LFSS_SPMWPROT7_WP_28_0_MASK              ((uint32_t)0x00000001U)         /* !< write protect SPMEM28 - DATA0 */
#define LFSS_SPMWPROT7_WP_28_0_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT7_WP_28_0_READONLY          ((uint32_t)0x00000001U)         /* !< SPMEM is read only access */

/* LFSS_SPMTERASE0 Bits */
/* LFSS_SPMTERASE0[KEY] Bits */
#define LFSS_SPMTERASE0_KEY_OFS                  (24)                            /* !< KEY Offset */
#define LFSS_SPMTERASE0_KEY_MASK                 ((uint32_t)0xFF000000U)         /* !< need to write (KEY=0xA3) to update
                                                                                    this register */
#define LFSS_SPMTERASE0_KEY_UNLOCK_W             ((uint32_t)0xA3000000U)         /* !< This field must be written with
                                                                                    0xA3 to be update the tamper erase
                                                                                    enable bit. */
/* LFSS_SPMTERASE0[TE_3_3] Bits */
#define LFSS_SPMTERASE0_TE_3_3_OFS               (15)                            /* !< TE_3_3 Offset */
#define LFSS_SPMTERASE0_TE_3_3_MASK              ((uint32_t)0x00008000U)         /* !< tamper erase enable SPMEM3 - DATA3 */
#define LFSS_SPMTERASE0_TE_3_3_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE0_TE_3_3_ENABLE            ((uint32_t)0x00008000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE0[TE_3_2] Bits */
#define LFSS_SPMTERASE0_TE_3_2_OFS               (14)                            /* !< TE_3_2 Offset */
#define LFSS_SPMTERASE0_TE_3_2_MASK              ((uint32_t)0x00004000U)         /* !< tamper erase enable SPMEM3 - DATA2 */
#define LFSS_SPMTERASE0_TE_3_2_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE0_TE_3_2_ENABLE            ((uint32_t)0x00004000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE0[TE_3_1] Bits */
#define LFSS_SPMTERASE0_TE_3_1_OFS               (13)                            /* !< TE_3_1 Offset */
#define LFSS_SPMTERASE0_TE_3_1_MASK              ((uint32_t)0x00002000U)         /* !< tamper erase enable SPMEM3 - DATA1 */
#define LFSS_SPMTERASE0_TE_3_1_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE0_TE_3_1_ENABLE            ((uint32_t)0x00002000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE0[TE_3_0] Bits */
#define LFSS_SPMTERASE0_TE_3_0_OFS               (12)                            /* !< TE_3_0 Offset */
#define LFSS_SPMTERASE0_TE_3_0_MASK              ((uint32_t)0x00001000U)         /* !< tamper erase enable SPMEM3 - DATA0 */
#define LFSS_SPMTERASE0_TE_3_0_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE0_TE_3_0_ENABLE            ((uint32_t)0x00001000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE0[TE_2_3] Bits */
#define LFSS_SPMTERASE0_TE_2_3_OFS               (11)                            /* !< TE_2_3 Offset */
#define LFSS_SPMTERASE0_TE_2_3_MASK              ((uint32_t)0x00000800U)         /* !< tamper erase enable SPMEM2 - DATA3 */
#define LFSS_SPMTERASE0_TE_2_3_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE0_TE_2_3_ENABLE            ((uint32_t)0x00000800U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE0[TE_2_2] Bits */
#define LFSS_SPMTERASE0_TE_2_2_OFS               (10)                            /* !< TE_2_2 Offset */
#define LFSS_SPMTERASE0_TE_2_2_MASK              ((uint32_t)0x00000400U)         /* !< tamper erase enable SPMEM2 - DATA2 */
#define LFSS_SPMTERASE0_TE_2_2_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE0_TE_2_2_ENABLE            ((uint32_t)0x00000400U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE0[TE_2_1] Bits */
#define LFSS_SPMTERASE0_TE_2_1_OFS               (9)                             /* !< TE_2_1 Offset */
#define LFSS_SPMTERASE0_TE_2_1_MASK              ((uint32_t)0x00000200U)         /* !< tamper erase enable SPMEM2 - DATA1 */
#define LFSS_SPMTERASE0_TE_2_1_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE0_TE_2_1_ENABLE            ((uint32_t)0x00000200U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE0[TE_2_0] Bits */
#define LFSS_SPMTERASE0_TE_2_0_OFS               (8)                             /* !< TE_2_0 Offset */
#define LFSS_SPMTERASE0_TE_2_0_MASK              ((uint32_t)0x00000100U)         /* !< tamper erase enable SPMEM2 - DATA0 */
#define LFSS_SPMTERASE0_TE_2_0_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE0_TE_2_0_ENABLE            ((uint32_t)0x00000100U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE0[TE_1_3] Bits */
#define LFSS_SPMTERASE0_TE_1_3_OFS               (7)                             /* !< TE_1_3 Offset */
#define LFSS_SPMTERASE0_TE_1_3_MASK              ((uint32_t)0x00000080U)         /* !< tamper erase enable SPMEM1 - DATA3 */
#define LFSS_SPMTERASE0_TE_1_3_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE0_TE_1_3_ENABLE            ((uint32_t)0x00000080U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE0[TE_1_2] Bits */
#define LFSS_SPMTERASE0_TE_1_2_OFS               (6)                             /* !< TE_1_2 Offset */
#define LFSS_SPMTERASE0_TE_1_2_MASK              ((uint32_t)0x00000040U)         /* !< tamper erase enable SPMEM1 - DATA2 */
#define LFSS_SPMTERASE0_TE_1_2_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE0_TE_1_2_ENABLE            ((uint32_t)0x00000040U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE0[TE_1_1] Bits */
#define LFSS_SPMTERASE0_TE_1_1_OFS               (5)                             /* !< TE_1_1 Offset */
#define LFSS_SPMTERASE0_TE_1_1_MASK              ((uint32_t)0x00000020U)         /* !< tamper erase enable SPMEM1 - DATA1 */
#define LFSS_SPMTERASE0_TE_1_1_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE0_TE_1_1_ENABLE            ((uint32_t)0x00000020U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE0[TE_1_0] Bits */
#define LFSS_SPMTERASE0_TE_1_0_OFS               (4)                             /* !< TE_1_0 Offset */
#define LFSS_SPMTERASE0_TE_1_0_MASK              ((uint32_t)0x00000010U)         /* !< tamper erase enable SPMEM1 - DATA0 */
#define LFSS_SPMTERASE0_TE_1_0_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE0_TE_1_0_ENABLE            ((uint32_t)0x00000010U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE0[TE_0_3] Bits */
#define LFSS_SPMTERASE0_TE_0_3_OFS               (3)                             /* !< TE_0_3 Offset */
#define LFSS_SPMTERASE0_TE_0_3_MASK              ((uint32_t)0x00000008U)         /* !< tamper erase enable SPMEM0 - DATA3 */
#define LFSS_SPMTERASE0_TE_0_3_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE0_TE_0_3_ENABLE            ((uint32_t)0x00000008U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE0[TE_0_2] Bits */
#define LFSS_SPMTERASE0_TE_0_2_OFS               (2)                             /* !< TE_0_2 Offset */
#define LFSS_SPMTERASE0_TE_0_2_MASK              ((uint32_t)0x00000004U)         /* !< tamper erase enable SPMEM0 - DATA2 */
#define LFSS_SPMTERASE0_TE_0_2_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE0_TE_0_2_ENABLE            ((uint32_t)0x00000004U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE0[TE_0_1] Bits */
#define LFSS_SPMTERASE0_TE_0_1_OFS               (1)                             /* !< TE_0_1 Offset */
#define LFSS_SPMTERASE0_TE_0_1_MASK              ((uint32_t)0x00000002U)         /* !< tamper erase enable SPMEM0 - DATA1 */
#define LFSS_SPMTERASE0_TE_0_1_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE0_TE_0_1_ENABLE            ((uint32_t)0x00000002U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE0[TE_0_0] Bits */
#define LFSS_SPMTERASE0_TE_0_0_OFS               (0)                             /* !< TE_0_0 Offset */
#define LFSS_SPMTERASE0_TE_0_0_MASK              ((uint32_t)0x00000001U)         /* !< tamper erase enable SPMEM0 - DATA0 */
#define LFSS_SPMTERASE0_TE_0_0_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE0_TE_0_0_ENABLE            ((uint32_t)0x00000001U)         /* !< SPMEM will be erased with tamper
                                                                                    event */

