sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_lfss.h
/* LFSS_SPMTERASE7 Bits */
/* LFSS_SPMTERASE7[KEY] Bits */
#define LFSS_SPMTERASE7_KEY_OFS                  (24)                            /* !< KEY Offset */
#define LFSS_SPMTERASE7_KEY_MASK                 ((uint32_t)0xFF000000U)         /* !< need to write (KEY=0xA3) to update
                                                                                    this register */
#define LFSS_SPMTERASE7_KEY_UNLOCK_W             ((uint32_t)0xA3000000U)         /* !< This field must be written with
                                                                                    0xA3 to be update the tamper erase
                                                                                    enable bit. */
/* LFSS_SPMTERASE7[TE_31_3] Bits */
#define LFSS_SPMTERASE7_TE_31_3_OFS              (15)                            /* !< TE_31_3 Offset */
#define LFSS_SPMTERASE7_TE_31_3_MASK             ((uint32_t)0x00008000U)         /* !< tamper erase enable SPMEM31 - DATA3 */
#define LFSS_SPMTERASE7_TE_31_3_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE7_TE_31_3_ENABLE           ((uint32_t)0x00008000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE7[TE_31_2] Bits */
#define LFSS_SPMTERASE7_TE_31_2_OFS              (14)                            /* !< TE_31_2 Offset */
#define LFSS_SPMTERASE7_TE_31_2_MASK             ((uint32_t)0x00004000U)         /* !< tamper erase enable SPMEM31 - DATA2 */
#define LFSS_SPMTERASE7_TE_31_2_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE7_TE_31_2_ENABLE           ((uint32_t)0x00004000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE7[TE_31_1] Bits */
#define LFSS_SPMTERASE7_TE_31_1_OFS              (13)                            /* !< TE_31_1 Offset */
#define LFSS_SPMTERASE7_TE_31_1_MASK             ((uint32_t)0x00002000U)         /* !< tamper erase enable SPMEM31 - DATA1 */
#define LFSS_SPMTERASE7_TE_31_1_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE7_TE_31_1_ENABLE           ((uint32_t)0x00002000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE7[TE_31_0] Bits */
#define LFSS_SPMTERASE7_TE_31_0_OFS              (12)                            /* !< TE_31_0 Offset */
#define LFSS_SPMTERASE7_TE_31_0_MASK             ((uint32_t)0x00001000U)         /* !< tamper erase enable SPMEM31 - DATA0 */
#define LFSS_SPMTERASE7_TE_31_0_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE7_TE_31_0_ENABLE           ((uint32_t)0x00001000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE7[TE_30_3] Bits */
#define LFSS_SPMTERASE7_TE_30_3_OFS              (11)                            /* !< TE_30_3 Offset */
#define LFSS_SPMTERASE7_TE_30_3_MASK             ((uint32_t)0x00000800U)         /* !< tamper erase enable SPMEM30 - DATA3 */
#define LFSS_SPMTERASE7_TE_30_3_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE7_TE_30_3_ENABLE           ((uint32_t)0x00000800U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE7[TE_30_2] Bits */
#define LFSS_SPMTERASE7_TE_30_2_OFS              (10)                            /* !< TE_30_2 Offset */
#define LFSS_SPMTERASE7_TE_30_2_MASK             ((uint32_t)0x00000400U)         /* !< tamper erase enable SPMEM30 - DATA2 */
#define LFSS_SPMTERASE7_TE_30_2_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE7_TE_30_2_ENABLE           ((uint32_t)0x00000400U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE7[TE_30_1] Bits */
#define LFSS_SPMTERASE7_TE_30_1_OFS              (9)                             /* !< TE_30_1 Offset */
#define LFSS_SPMTERASE7_TE_30_1_MASK             ((uint32_t)0x00000200U)         /* !< tamper erase enable SPMEM30 - DATA1 */
#define LFSS_SPMTERASE7_TE_30_1_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE7_TE_30_1_ENABLE           ((uint32_t)0x00000200U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE7[TE_30_0] Bits */
#define LFSS_SPMTERASE7_TE_30_0_OFS              (8)                             /* !< TE_30_0 Offset */
#define LFSS_SPMTERASE7_TE_30_0_MASK             ((uint32_t)0x00000100U)         /* !< tamper erase enable SPMEM30 - DATA0 */
#define LFSS_SPMTERASE7_TE_30_0_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE7_TE_30_0_ENABLE           ((uint32_t)0x00000100U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE7[TE_29_3] Bits */
#define LFSS_SPMTERASE7_TE_29_3_OFS              (7)                             /* !< TE_29_3 Offset */
#define LFSS_SPMTERASE7_TE_29_3_MASK             ((uint32_t)0x00000080U)         /* !< tamper erase enable SPMEM29 - DATA3 */
#define LFSS_SPMTERASE7_TE_29_3_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE7_TE_29_3_ENABLE           ((uint32_t)0x00000080U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE7[TE_29_2] Bits */
#define LFSS_SPMTERASE7_TE_29_2_OFS              (6)                             /* !< TE_29_2 Offset */
#define LFSS_SPMTERASE7_TE_29_2_MASK             ((uint32_t)0x00000040U)         /* !< tamper erase enable SPMEM29 - DATA2 */
#define LFSS_SPMTERASE7_TE_29_2_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE7_TE_29_2_ENABLE           ((uint32_t)0x00000040U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE7[TE_29_1] Bits */
#define LFSS_SPMTERASE7_TE_29_1_OFS              (5)                             /* !< TE_29_1 Offset */
#define LFSS_SPMTERASE7_TE_29_1_MASK             ((uint32_t)0x00000020U)         /* !< tamper erase enable SPMEM29 - DATA1 */
#define LFSS_SPMTERASE7_TE_29_1_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE7_TE_29_1_ENABLE           ((uint32_t)0x00000020U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE7[TE_29_0] Bits */
#define LFSS_SPMTERASE7_TE_29_0_OFS              (4)                             /* !< TE_29_0 Offset */
#define LFSS_SPMTERASE7_TE_29_0_MASK             ((uint32_t)0x00000010U)         /* !< tamper erase enable SPMEM29 - DATA0 */
#define LFSS_SPMTERASE7_TE_29_0_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE7_TE_29_0_ENABLE           ((uint32_t)0x00000010U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE7[TE_28_3] Bits */
#define LFSS_SPMTERASE7_TE_28_3_OFS              (3)                             /* !< TE_28_3 Offset */
#define LFSS_SPMTERASE7_TE_28_3_MASK             ((uint32_t)0x00000008U)         /* !< tamper erase enable SPMEM28 - DATA3 */
#define LFSS_SPMTERASE7_TE_28_3_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE7_TE_28_3_ENABLE           ((uint32_t)0x00000008U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE7[TE_28_2] Bits */
#define LFSS_SPMTERASE7_TE_28_2_OFS              (2)                             /* !< TE_28_2 Offset */
#define LFSS_SPMTERASE7_TE_28_2_MASK             ((uint32_t)0x00000004U)         /* !< tamper erase enable SPMEM28 - DATA2 */
#define LFSS_SPMTERASE7_TE_28_2_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE7_TE_28_2_ENABLE           ((uint32_t)0x00000004U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE7[TE_28_1] Bits */
#define LFSS_SPMTERASE7_TE_28_1_OFS              (1)                             /* !< TE_28_1 Offset */
#define LFSS_SPMTERASE7_TE_28_1_MASK             ((uint32_t)0x00000002U)         /* !< tamper erase enable SPMEM28 - DATA1 */
#define LFSS_SPMTERASE7_TE_28_1_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE7_TE_28_1_ENABLE           ((uint32_t)0x00000002U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE7[TE_28_0] Bits */
#define LFSS_SPMTERASE7_TE_28_0_OFS              (0)                             /* !< TE_28_0 Offset */
#define LFSS_SPMTERASE7_TE_28_0_MASK             ((uint32_t)0x00000001U)         /* !< tamper erase enable SPMEM28 - DATA0 */
#define LFSS_SPMTERASE7_TE_28_0_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE7_TE_28_0_ENABLE           ((uint32_t)0x00000001U)         /* !< SPMEM will be erased with tamper
                                                                                    event */

/* LFSS_WDTEN Bits */
/* LFSS_WDTEN[ENABLE] Bits */
#define LFSS_WDTEN_ENABLE_OFS                    (0)                             /* !< ENABLE Offset */
#define LFSS_WDTEN_ENABLE_MASK                   ((uint32_t)0x00000001U)         /* !< Enable bit for the WDT. */
#define LFSS_WDTEN_ENABLE_CLR                    ((uint32_t)0x00000000U)         /* !< Disable WDT */
#define LFSS_WDTEN_ENABLE_SET                    ((uint32_t)0x00000001U)         /* !< Enable WDT */
/* LFSS_WDTEN[KEY] Bits */
#define LFSS_WDTEN_KEY_OFS                       (24)                            /* !< KEY Offset */
#define LFSS_WDTEN_KEY_MASK                      ((uint32_t)0xFF000000U)         /* !< KEY to allow write access to this
                                                                                    register. Writing to this register
                                                                                    with an incorrect key causes a POR
                                                                                    level reset. Read as 0. */
#define LFSS_WDTEN_KEY_UNLOCK_W                  ((uint32_t)0xEE000000U)         /* !< This field must be written with
                                                                                    0xEE to be update the enable bit. */

/* LFSS_WDTDBGCTL Bits */
/* LFSS_WDTDBGCTL[FREE] Bits */
#define LFSS_WDTDBGCTL_FREE_OFS                  (0)                             /* !< FREE Offset */
#define LFSS_WDTDBGCTL_FREE_MASK                 ((uint32_t)0x00000001U)         /* !< Free run control */
#define LFSS_WDTDBGCTL_FREE_STOP                 ((uint32_t)0x00000000U)         /* !< The WDT freezes functionality while
                                                                                    the CPU is Halted during debug and
                                                                                    resumes when the CPU is active. */
#define LFSS_WDTDBGCTL_FREE_RUN                  ((uint32_t)0x00000001U)         /* !< The WDT ignores the state of the
                                                                                    CPU Halted debug state. */

/* LFSS_WDTCTL Bits */
/* LFSS_WDTCTL[CLKDIV] Bits */
#define LFSS_WDTCTL_CLKDIV_OFS                   (0)                             /* !< CLKDIV Offset */
#define LFSS_WDTCTL_CLKDIV_MASK                  ((uint32_t)0x00000007U)         /* !< Module Clock Divider, Divide the
                                                                                    clock source by CLKDIV+1. Divider
                                                                                    values from /1 to /8 are possible. */
#define LFSS_WDTCTL_CLKDIV_MIN                   ((uint32_t)0x00000000U)         /* !< Minimum value */
#define LFSS_WDTCTL_CLKDIV_MAX                   ((uint32_t)0x00000007U)         /* !< Maximum value */
/* LFSS_WDTCTL[PER] Bits */
#define LFSS_WDTCTL_PER_OFS                      (4)                             /* !< PER Offset */
#define LFSS_WDTCTL_PER_MASK                     ((uint32_t)0x00000070U)         /* !< Timer Period of the WDT. These bits
                                                                                    select the total watchdog timer
                                                                                    count. */
#define LFSS_WDTCTL_PER_PER_EN_25                ((uint32_t)0x00000000U)         /* !< Total timer count is 2^25 */
#define LFSS_WDTCTL_PER_PER_EN_21                ((uint32_t)0x00000010U)         /* !< Total timer count is 2^21 */
#define LFSS_WDTCTL_PER_PER_EN_18                ((uint32_t)0x00000020U)         /* !< Total timer count is 2^18 */
#define LFSS_WDTCTL_PER_PER_EN_15                ((uint32_t)0x00000030U)         /* !< Total timer count is 2^15 */
#define LFSS_WDTCTL_PER_PER_EN_12                ((uint32_t)0x00000040U)         /* !< Total timer count is 2^12 (default) */
#define LFSS_WDTCTL_PER_PER_EN_10                ((uint32_t)0x00000050U)         /* !< Total timer count is 2^10 */
#define LFSS_WDTCTL_PER_PER_EN_8                 ((uint32_t)0x00000060U)         /* !< Total timer count is 2^8 */
#define LFSS_WDTCTL_PER_PER_EN_6                 ((uint32_t)0x00000070U)         /* !< Total timer count is 2^6 */
/* LFSS_WDTCTL[KEY] Bits */
#define LFSS_WDTCTL_KEY_OFS                      (24)                            /* !< KEY Offset */
#define LFSS_WDTCTL_KEY_MASK                     ((uint32_t)0xFF000000U)         /* !< KEY to allow write access to this
                                                                                    register. Writing to this register
                                                                                    with an incorrect key causes a POR
                                                                                    level reset. Read as 0. */
#define LFSS_WDTCTL_KEY_UNLOCK_W                 ((uint32_t)0xC6000000U)         /* !< This field must be written with
                                                                                    0xC6 to be able to write any of the
                                                                                    enable bits */

/* LFSS_WDTCNTRST Bits */
/* LFSS_WDTCNTRST[RESTART] Bits */
#define LFSS_WDTCNTRST_RESTART_OFS               (0)                             /* !< RESTART Offset */
#define LFSS_WDTCNTRST_RESTART_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< Writing 03A7h to this register
                                                                                    restarts the WDT Counter. Writing any
                                                                                    other value causes a POR level reset.
                                                                                    Read as 0x0h. */
#define LFSS_WDTCNTRST_RESTART_MINIMUM           ((uint32_t)0x00000000U)         /* !< Minimum value */
#define LFSS_WDTCNTRST_RESTART_VALUE             ((uint32_t)0x000003A7U)         /* !< VALUE to restart the WDT counter */
#define LFSS_WDTCNTRST_RESTART_MAXIMUM           ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value */

/* LFSS_WDTSTAT Bits */
/* LFSS_WDTSTAT[RUN] Bits */
#define LFSS_WDTSTAT_RUN_OFS                     (0)                             /* !< RUN Offset */
#define LFSS_WDTSTAT_RUN_MASK                    ((uint32_t)0x00000001U)         /* !< Watchdog running status flag. */
#define LFSS_WDTSTAT_RUN_STOP                    ((uint32_t)0x00000000U)         /* !< Watchdog counter stopped. */
#define LFSS_WDTSTAT_RUN_RUN                     ((uint32_t)0x00000001U)         /* !< Watchdog running. */

