sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_lfss.h
/* LFSS_WDTLOCK Bits */
/* LFSS_WDTLOCK[PROTECT] Bits */
#define LFSS_WDTLOCK_PROTECT_OFS                 (0)                             /* !< PROTECT Offset */
#define LFSS_WDTLOCK_PROTECT_MASK                ((uint32_t)0x00000001U)         /* !< If set, the register bit will
                                                                                    protect the WDTEN and WDTCTL from
                                                                                    accidental writes. */
#define LFSS_WDTLOCK_PROTECT_CLR                 ((uint32_t)0x00000000U)         /* !< Watchdog timer control is writable. */
#define LFSS_WDTLOCK_PROTECT_SET                 ((uint32_t)0x00000001U)         /* !< Watchdog timer control is read only
                                                                                    access. */
/* LFSS_WDTLOCK[KEY] Bits */
#define LFSS_WDTLOCK_KEY_OFS                     (24)                            /* !< KEY Offset */
#define LFSS_WDTLOCK_KEY_MASK                    ((uint32_t)0xFF000000U)         /* !< need to write (KEY=0xBD) to update
                                                                                    this register */
#define LFSS_WDTLOCK_KEY_UNLOCK_W                ((uint32_t)0xBD000000U)         /* !< This field must be written with
                                                                                    0xBD to be able to clear any of the
                                                                                    enable bits */

/* LFSS_TIOCTL Bits */
/* LFSS_TIOCTL[IOMUX] Bits */
#define LFSS_TIOCTL_IOMUX_OFS                    (0)                             /* !< IOMUX Offset */
#define LFSS_TIOCTL_IOMUX_MASK                   ((uint32_t)0x00000001U)         /* !< tamper I/O is controlled by SoC
                                                                                    IOMUX module */
#define LFSS_TIOCTL_IOMUX_IOMUX                  ((uint32_t)0x00000000U)         /* !< The tamper I/O is controlled by the
                                                                                    IOMUX of the SoC and does allow
                                                                                    assignment to a peripheral function.
                                                                                    In the case the main supply (VDD) is
                                                                                    lost, this I/O will go into a Hi-Z
                                                                                    state. */
#define LFSS_TIOCTL_IOMUX_TAMPER                 ((uint32_t)0x00000001U)         /* !< The tamper I/O is controlled by the
                                                                                    TIOCTL register and stays functional
                                                                                    during loss of the main supply (VDD). */
/* LFSS_TIOCTL[PIPD] Bits */
#define LFSS_TIOCTL_PIPD_OFS                     (16)                            /* !< PIPD Offset */
#define LFSS_TIOCTL_PIPD_MASK                    ((uint32_t)0x00010000U)         /* !< pull down enable */
#define LFSS_TIOCTL_PIPD_DISABLE                 ((uint32_t)0x00000000U)         /* !< The pull-down function is disabled. */
#define LFSS_TIOCTL_PIPD_ENABLE                  ((uint32_t)0x00010000U)         /* !< The pull-down function is enabled. */
/* LFSS_TIOCTL[PIPU] Bits */
#define LFSS_TIOCTL_PIPU_OFS                     (17)                            /* !< PIPU Offset */
#define LFSS_TIOCTL_PIPU_MASK                    ((uint32_t)0x00020000U)         /* !< pull up enable */
#define LFSS_TIOCTL_PIPU_DISABLE                 ((uint32_t)0x00000000U)         /* !< The pull-up function is disabled. */
#define LFSS_TIOCTL_PIPU_ENABLE                  ((uint32_t)0x00020000U)         /* !< The pull-up function is enabled. */
/* LFSS_TIOCTL[INENA] Bits */
#define LFSS_TIOCTL_INENA_OFS                    (18)                            /* !< INENA Offset */
#define LFSS_TIOCTL_INENA_MASK                   ((uint32_t)0x00040000U)         /* !< input enable */
#define LFSS_TIOCTL_INENA_DISABLE                ((uint32_t)0x00000000U)         /* !< The input path is disabled. */
#define LFSS_TIOCTL_INENA_ENABLE                 ((uint32_t)0x00040000U)         /* !< The input path is enabled. */
/* LFSS_TIOCTL[POLARITY] Bits */
#define LFSS_TIOCTL_POLARITY_OFS                 (8)                             /* !< POLARITY Offset */
#define LFSS_TIOCTL_POLARITY_MASK                ((uint32_t)0x00000300U)         /* !< Enables and configures edge
                                                                                    detection polarity for TIO */
#define LFSS_TIOCTL_POLARITY_DISABLE             ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define LFSS_TIOCTL_POLARITY_RISE                ((uint32_t)0x00000100U)         /* !< Detects rising edge of input event */
#define LFSS_TIOCTL_POLARITY_FALL                ((uint32_t)0x00000200U)         /* !< Detects falling edge of input event */
#define LFSS_TIOCTL_POLARITY_BOTH                ((uint32_t)0x00000300U)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* LFSS_TIOCTL[FILTEREN] Bits */
#define LFSS_TIOCTL_FILTEREN_OFS                 (12)                            /* !< FILTEREN Offset */
#define LFSS_TIOCTL_FILTEREN_MASK                ((uint32_t)0x00003000U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for TIO0 */
#define LFSS_TIOCTL_FILTEREN_NO_FLT              ((uint32_t)0x00000000U)         /* !< no filter on the tamper I/O beyond
                                                                                    CDC synchronization sample */
#define LFSS_TIOCTL_FILTEREN_FLT_1               ((uint32_t)0x00001000U)         /* !< 1 FLCLK minimum sample (30us) */
#define LFSS_TIOCTL_FILTEREN_FLT_2               ((uint32_t)0x00002000U)         /* !< 3 LFCLK minimum sample (100us) */
#define LFSS_TIOCTL_FILTEREN_FLT_3               ((uint32_t)0x00003000U)         /* !< 6 LFCLK minimum sample (200us) */
/* LFSS_TIOCTL[TOUTSEL] Bits */
#define LFSS_TIOCTL_TOUTSEL_OFS                  (4)                             /* !< TOUTSEL Offset */
#define LFSS_TIOCTL_TOUTSEL_MASK                 ((uint32_t)0x00000030U)         /* !< Selects the source for TOUT control */
#define LFSS_TIOCTL_TOUTSEL_TOUT                 ((uint32_t)0x00000000U)         /* !< The TOUT register is the source for
                                                                                    TOUT */
#define LFSS_TIOCTL_TOUTSEL_LFCLKEXT             ((uint32_t)0x00000010U)         /* !< The LFCLK is the source for TOUT */
#define LFSS_TIOCTL_TOUTSEL_HEARTBEAT            ((uint32_t)0x00000020U)         /* !< The heart beat generatore is the
                                                                                    source for TOUT */
#define LFSS_TIOCTL_TOUTSEL_TSEVTSTAT            ((uint32_t)0x00000030U)         /* !< The time stamp event status is the
                                                                                    source for TOUT */
/* LFSS_TIOCTL[OUTINV] Bits */
#define LFSS_TIOCTL_OUTINV_OFS                   (19)                            /* !< OUTINV Offset */
#define LFSS_TIOCTL_OUTINV_MASK                  ((uint32_t)0x00080000U)         /* !< Output inversion enable */
#define LFSS_TIOCTL_OUTINV_DISBALE               ((uint32_t)0x00000000U)         /* !< The output inversion is disabled. */
#define LFSS_TIOCTL_OUTINV_ENABLE                ((uint32_t)0x00080000U)         /* !< The output inversion is enabled. */

/* LFSS_TOUT3_0 Bits */
/* LFSS_TOUT3_0[TIO0] Bits */
#define LFSS_TOUT3_0_TIO0_OFS                    (0)                             /* !< TIO0 Offset */
#define LFSS_TOUT3_0_TIO0_MASK                   ((uint32_t)0x00000001U)         /* !< This bit sets the value of the pin
                                                                                    tamper I/O 0 (TIO0) when the output
                                                                                    is enabled through TOE0 register. */
#define LFSS_TOUT3_0_TIO0_ZERO                   ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define LFSS_TOUT3_0_TIO0_ONE                    ((uint32_t)0x00000001U)         /* !< Output is set to 1 */
/* LFSS_TOUT3_0[TIO1] Bits */
#define LFSS_TOUT3_0_TIO1_OFS                    (8)                             /* !< TIO1 Offset */
#define LFSS_TOUT3_0_TIO1_MASK                   ((uint32_t)0x00000100U)         /* !< This bit sets the value of the pin
                                                                                    tamper I/O 1 (TIO1) when the output
                                                                                    is enabled through TOE1 register. */
#define LFSS_TOUT3_0_TIO1_ZERO                   ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define LFSS_TOUT3_0_TIO1_ONE                    ((uint32_t)0x00000100U)         /* !< Output is set to 1 */
/* LFSS_TOUT3_0[TIO2] Bits */
#define LFSS_TOUT3_0_TIO2_OFS                    (16)                            /* !< TIO2 Offset */
#define LFSS_TOUT3_0_TIO2_MASK                   ((uint32_t)0x00010000U)         /* !< This bit sets the value of the pin
                                                                                    tamper I/O 2 (TIO0) when the output
                                                                                    is enabled through TOE2 register. */
#define LFSS_TOUT3_0_TIO2_ZERO                   ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define LFSS_TOUT3_0_TIO2_ONE                    ((uint32_t)0x00010000U)         /* !< Output is set to 1 */
/* LFSS_TOUT3_0[TIO3] Bits */
#define LFSS_TOUT3_0_TIO3_OFS                    (24)                            /* !< TIO3 Offset */
#define LFSS_TOUT3_0_TIO3_MASK                   ((uint32_t)0x01000000U)         /* !< This bit sets the value of the pin
                                                                                    tamper I/O 3 (TIO3) when the output
                                                                                    is enabled through TOE3 register. */
#define LFSS_TOUT3_0_TIO3_ZERO                   ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define LFSS_TOUT3_0_TIO3_ONE                    ((uint32_t)0x01000000U)         /* !< Output is set to 1 */

/* LFSS_TOUT7_4 Bits */
/* LFSS_TOUT7_4[TIO4] Bits */
#define LFSS_TOUT7_4_TIO4_OFS                    (0)                             /* !< TIO4 Offset */
#define LFSS_TOUT7_4_TIO4_MASK                   ((uint32_t)0x00000001U)         /* !< This bit sets the value of the pin
                                                                                    tamper I/O 4 (TIO4) when the output
                                                                                    is enabled through TOE4 register. */
#define LFSS_TOUT7_4_TIO4_ZERO                   ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define LFSS_TOUT7_4_TIO4_ONE                    ((uint32_t)0x00000001U)         /* !< Output is set to 1 */
/* LFSS_TOUT7_4[TIO5] Bits */
#define LFSS_TOUT7_4_TIO5_OFS                    (8)                             /* !< TIO5 Offset */
#define LFSS_TOUT7_4_TIO5_MASK                   ((uint32_t)0x00000100U)         /* !< This bit sets the value of the pin
                                                                                    tamper I/O 5 (TIO5) when the output
                                                                                    is enabled through TOE5 register. */
#define LFSS_TOUT7_4_TIO5_ZERO                   ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define LFSS_TOUT7_4_TIO5_ONE                    ((uint32_t)0x00000100U)         /* !< Output is set to 1 */
/* LFSS_TOUT7_4[TIO6] Bits */
#define LFSS_TOUT7_4_TIO6_OFS                    (16)                            /* !< TIO6 Offset */
#define LFSS_TOUT7_4_TIO6_MASK                   ((uint32_t)0x00010000U)         /* !< This bit sets the value of the pin
                                                                                    tamper I/O 2 (TIO6) when the output
                                                                                    is enabled through TOE6 register. */
#define LFSS_TOUT7_4_TIO6_ZERO                   ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define LFSS_TOUT7_4_TIO6_ONE                    ((uint32_t)0x00010000U)         /* !< Output is set to 1 */
/* LFSS_TOUT7_4[TIO7] Bits */
#define LFSS_TOUT7_4_TIO7_OFS                    (24)                            /* !< TIO7 Offset */
#define LFSS_TOUT7_4_TIO7_MASK                   ((uint32_t)0x01000000U)         /* !< This bit sets the value of the pin
                                                                                    tamper I/O 7 (TIO7) when the output
                                                                                    is enabled through TOE7 register. */
#define LFSS_TOUT7_4_TIO7_ZERO                   ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define LFSS_TOUT7_4_TIO7_ONE                    ((uint32_t)0x01000000U)         /* !< Output is set to 1 */

/* LFSS_TOUT11_8 Bits */
/* LFSS_TOUT11_8[TIO8] Bits */
#define LFSS_TOUT11_8_TIO8_OFS                   (0)                             /* !< TIO8 Offset */
#define LFSS_TOUT11_8_TIO8_MASK                  ((uint32_t)0x00000001U)         /* !< This bit sets the value of the pin
                                                                                    tamper I/O 8 (TIO8) when the output
                                                                                    is enabled through TOE8 register. */
#define LFSS_TOUT11_8_TIO8_ZERO                  ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define LFSS_TOUT11_8_TIO8_ONE                   ((uint32_t)0x00000001U)         /* !< Output is set to 1 */
/* LFSS_TOUT11_8[TIO9] Bits */
#define LFSS_TOUT11_8_TIO9_OFS                   (8)                             /* !< TIO9 Offset */
#define LFSS_TOUT11_8_TIO9_MASK                  ((uint32_t)0x00000100U)         /* !< This bit sets the value of the pin
                                                                                    tamper I/O 9 (TIO9) when the output
                                                                                    is enabled through TOE9 register. */
#define LFSS_TOUT11_8_TIO9_ZERO                  ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define LFSS_TOUT11_8_TIO9_ONE                   ((uint32_t)0x00000100U)         /* !< Output is set to 1 */
/* LFSS_TOUT11_8[TIO10] Bits */
#define LFSS_TOUT11_8_TIO10_OFS                  (16)                            /* !< TIO10 Offset */
#define LFSS_TOUT11_8_TIO10_MASK                 ((uint32_t)0x00010000U)         /* !< This bit sets the value of the pin
                                                                                    tamper I/O 10 (TIO10) when the output
                                                                                    is enabled through TOE10 register. */
#define LFSS_TOUT11_8_TIO10_ZERO                 ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define LFSS_TOUT11_8_TIO10_ONE                  ((uint32_t)0x00010000U)         /* !< Output is set to 1 */
/* LFSS_TOUT11_8[TIO11] Bits */
#define LFSS_TOUT11_8_TIO11_OFS                  (24)                            /* !< TIO11 Offset */
#define LFSS_TOUT11_8_TIO11_MASK                 ((uint32_t)0x01000000U)         /* !< This bit sets the value of the pin
                                                                                    tamper I/O 11 (TIO11) when the output
                                                                                    is enabled through TOE11 register. */
#define LFSS_TOUT11_8_TIO11_ZERO                 ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define LFSS_TOUT11_8_TIO11_ONE                  ((uint32_t)0x01000000U)         /* !< Output is set to 1 */

/* LFSS_TOUT15_12 Bits */
/* LFSS_TOUT15_12[TIO12] Bits */
#define LFSS_TOUT15_12_TIO12_OFS                 (0)                             /* !< TIO12 Offset */
#define LFSS_TOUT15_12_TIO12_MASK                ((uint32_t)0x00000001U)         /* !< This bit sets the value of the pin
                                                                                    tamper I/O 12 (TIO12) when the output
                                                                                    is enabled through TOE12 register. */
#define LFSS_TOUT15_12_TIO12_ZERO                ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define LFSS_TOUT15_12_TIO12_ONE                 ((uint32_t)0x00000001U)         /* !< Output is set to 1 */
/* LFSS_TOUT15_12[TIO13] Bits */
#define LFSS_TOUT15_12_TIO13_OFS                 (8)                             /* !< TIO13 Offset */
#define LFSS_TOUT15_12_TIO13_MASK                ((uint32_t)0x00000100U)         /* !< This bit sets the value of the pin
                                                                                    tamper I/O 13 (TIO13) when the output
                                                                                    is enabled through TOE13 register. */
#define LFSS_TOUT15_12_TIO13_ZERO                ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define LFSS_TOUT15_12_TIO13_ONE                 ((uint32_t)0x00000100U)         /* !< Output is set to 1 */
/* LFSS_TOUT15_12[TIO14] Bits */
#define LFSS_TOUT15_12_TIO14_OFS                 (16)                            /* !< TIO14 Offset */
#define LFSS_TOUT15_12_TIO14_MASK                ((uint32_t)0x00010000U)         /* !< This bit sets the value of the pin
                                                                                    tamper I/O 14 (TIO14) when the output
                                                                                    is enabled through TOE14 register. */
#define LFSS_TOUT15_12_TIO14_ZERO                ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define LFSS_TOUT15_12_TIO14_ONE                 ((uint32_t)0x00010000U)         /* !< Output is set to 1 */
/* LFSS_TOUT15_12[TIO15] Bits */
#define LFSS_TOUT15_12_TIO15_OFS                 (24)                            /* !< TIO15 Offset */
#define LFSS_TOUT15_12_TIO15_MASK                ((uint32_t)0x01000000U)         /* !< This bit sets the value of the pin
                                                                                    tamper I/O 15 (TIO15) when the output
                                                                                    is enabled through TOE15 register. */
#define LFSS_TOUT15_12_TIO15_ZERO                ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define LFSS_TOUT15_12_TIO15_ONE                 ((uint32_t)0x01000000U)         /* !< Output is set to 1 */

/* LFSS_TOE3_0 Bits */
/* LFSS_TOE3_0[TIO0] Bits */
#define LFSS_TOE3_0_TIO0_OFS                     (0)                             /* !< TIO0 Offset */
#define LFSS_TOE3_0_TIO0_MASK                    ((uint32_t)0x00000001U)         /* !< Enables data output for tamper I/O
                                                                                    0 */
#define LFSS_TOE3_0_TIO0_DISABLE                 ((uint32_t)0x00000000U)         /* !< output disabled */
#define LFSS_TOE3_0_TIO0_ENABLE                  ((uint32_t)0x00000001U)         /* !< output enabled */
/* LFSS_TOE3_0[TIO1] Bits */
#define LFSS_TOE3_0_TIO1_OFS                     (8)                             /* !< TIO1 Offset */
#define LFSS_TOE3_0_TIO1_MASK                    ((uint32_t)0x00000100U)         /* !< Enables data output for tamper I/O
                                                                                    1 */
#define LFSS_TOE3_0_TIO1_DISABLE                 ((uint32_t)0x00000000U)         /* !< output disabled */
#define LFSS_TOE3_0_TIO1_ENABLE                  ((uint32_t)0x00000100U)         /* !< output enabled */
/* LFSS_TOE3_0[TIO2] Bits */
#define LFSS_TOE3_0_TIO2_OFS                     (16)                            /* !< TIO2 Offset */
#define LFSS_TOE3_0_TIO2_MASK                    ((uint32_t)0x00010000U)         /* !< Enables data output for tamper I/O
                                                                                    2 */
#define LFSS_TOE3_0_TIO2_DISABLE                 ((uint32_t)0x00000000U)         /* !< output disabled */
#define LFSS_TOE3_0_TIO2_ENABLE                  ((uint32_t)0x00010000U)         /* !< output enabled */
/* LFSS_TOE3_0[TIO3] Bits */
#define LFSS_TOE3_0_TIO3_OFS                     (24)                            /* !< TIO3 Offset */
#define LFSS_TOE3_0_TIO3_MASK                    ((uint32_t)0x01000000U)         /* !< Enables data output for tamper I/O
                                                                                    3 */
#define LFSS_TOE3_0_TIO3_DISABLE                 ((uint32_t)0x00000000U)         /* !< output disabled */
#define LFSS_TOE3_0_TIO3_ENABLE                  ((uint32_t)0x01000000U)         /* !< output enabled */

