sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_lfss.h
/* LFSS_TOE7_4 Bits */
/* LFSS_TOE7_4[TIO4] Bits */
#define LFSS_TOE7_4_TIO4_OFS                     (0)                             /* !< TIO4 Offset */
#define LFSS_TOE7_4_TIO4_MASK                    ((uint32_t)0x00000001U)         /* !< Enables data output for tamper I/O
                                                                                    4 */
#define LFSS_TOE7_4_TIO4_DISABLE                 ((uint32_t)0x00000000U)         /* !< output disabled */
#define LFSS_TOE7_4_TIO4_ENABLE                  ((uint32_t)0x00000001U)         /* !< output enabled */
/* LFSS_TOE7_4[TIO5] Bits */
#define LFSS_TOE7_4_TIO5_OFS                     (8)                             /* !< TIO5 Offset */
#define LFSS_TOE7_4_TIO5_MASK                    ((uint32_t)0x00000100U)         /* !< Enables data output for tamper I/O
                                                                                    5 */
#define LFSS_TOE7_4_TIO5_DISABLE                 ((uint32_t)0x00000000U)         /* !< output disabled */
#define LFSS_TOE7_4_TIO5_ENABLE                  ((uint32_t)0x00000100U)         /* !< output enabled */
/* LFSS_TOE7_4[TIO6] Bits */
#define LFSS_TOE7_4_TIO6_OFS                     (16)                            /* !< TIO6 Offset */
#define LFSS_TOE7_4_TIO6_MASK                    ((uint32_t)0x00010000U)         /* !< Enables data output for tamper I/O
                                                                                    6 */
#define LFSS_TOE7_4_TIO6_DISABLE                 ((uint32_t)0x00000000U)         /* !< output disabled */
#define LFSS_TOE7_4_TIO6_ENABLE                  ((uint32_t)0x00010000U)         /* !< output enabled */
/* LFSS_TOE7_4[TIO7] Bits */
#define LFSS_TOE7_4_TIO7_OFS                     (24)                            /* !< TIO7 Offset */
#define LFSS_TOE7_4_TIO7_MASK                    ((uint32_t)0x01000000U)         /* !< Enables data output for tamper I/O
                                                                                    7 */
#define LFSS_TOE7_4_TIO7_DISABLE                 ((uint32_t)0x00000000U)         /* !< output disabled */
#define LFSS_TOE7_4_TIO7_ENABLE                  ((uint32_t)0x01000000U)         /* !< output enabled */

/* LFSS_TOE11_8 Bits */
/* LFSS_TOE11_8[TIO8] Bits */
#define LFSS_TOE11_8_TIO8_OFS                    (0)                             /* !< TIO8 Offset */
#define LFSS_TOE11_8_TIO8_MASK                   ((uint32_t)0x00000001U)         /* !< Enables data output for tamper I/O
                                                                                    8 */
#define LFSS_TOE11_8_TIO8_DISABLE                ((uint32_t)0x00000000U)         /* !< output disabled */
#define LFSS_TOE11_8_TIO8_ENABLE                 ((uint32_t)0x00000001U)         /* !< output enabled */
/* LFSS_TOE11_8[TIO9] Bits */
#define LFSS_TOE11_8_TIO9_OFS                    (8)                             /* !< TIO9 Offset */
#define LFSS_TOE11_8_TIO9_MASK                   ((uint32_t)0x00000100U)         /* !< Enables data output for tamper I/O
                                                                                    9 */
#define LFSS_TOE11_8_TIO9_DISABLE                ((uint32_t)0x00000000U)         /* !< output disabled */
#define LFSS_TOE11_8_TIO9_ENABLE                 ((uint32_t)0x00000100U)         /* !< output enabled */
/* LFSS_TOE11_8[TIO10] Bits */
#define LFSS_TOE11_8_TIO10_OFS                   (16)                            /* !< TIO10 Offset */
#define LFSS_TOE11_8_TIO10_MASK                  ((uint32_t)0x00010000U)         /* !< Enables data output for tamper I/O
                                                                                    10 */
#define LFSS_TOE11_8_TIO10_DISABLE               ((uint32_t)0x00000000U)         /* !< output disabled */
#define LFSS_TOE11_8_TIO10_ENABLE                ((uint32_t)0x00010000U)         /* !< output enabled */
/* LFSS_TOE11_8[TIO11] Bits */
#define LFSS_TOE11_8_TIO11_OFS                   (24)                            /* !< TIO11 Offset */
#define LFSS_TOE11_8_TIO11_MASK                  ((uint32_t)0x01000000U)         /* !< Enables data output for tamper I/O
                                                                                    11 */
#define LFSS_TOE11_8_TIO11_DISABLE               ((uint32_t)0x00000000U)         /* !< output disabled */
#define LFSS_TOE11_8_TIO11_ENABLE                ((uint32_t)0x01000000U)         /* !< output enabled */

/* LFSS_TOE15_12 Bits */
/* LFSS_TOE15_12[TIO12] Bits */
#define LFSS_TOE15_12_TIO12_OFS                  (0)                             /* !< TIO12 Offset */
#define LFSS_TOE15_12_TIO12_MASK                 ((uint32_t)0x00000001U)         /* !< Enables data output for tamper I/O
                                                                                    12 */
#define LFSS_TOE15_12_TIO12_DISABLE              ((uint32_t)0x00000000U)         /* !< output disabled */
#define LFSS_TOE15_12_TIO12_ENABLE               ((uint32_t)0x00000001U)         /* !< output enabled */
/* LFSS_TOE15_12[TIO13] Bits */
#define LFSS_TOE15_12_TIO13_OFS                  (8)                             /* !< TIO13 Offset */
#define LFSS_TOE15_12_TIO13_MASK                 ((uint32_t)0x00000100U)         /* !< Enables data output for tamper I/O
                                                                                    13 */
#define LFSS_TOE15_12_TIO13_DISABLE              ((uint32_t)0x00000000U)         /* !< output disabled */
#define LFSS_TOE15_12_TIO13_ENABLE               ((uint32_t)0x00000100U)         /* !< output enabled */
/* LFSS_TOE15_12[TIO14] Bits */
#define LFSS_TOE15_12_TIO14_OFS                  (16)                            /* !< TIO14 Offset */
#define LFSS_TOE15_12_TIO14_MASK                 ((uint32_t)0x00010000U)         /* !< Enables data output for tamper I/O
                                                                                    14 */
#define LFSS_TOE15_12_TIO14_DISABLE              ((uint32_t)0x00000000U)         /* !< output disabled */
#define LFSS_TOE15_12_TIO14_ENABLE               ((uint32_t)0x00010000U)         /* !< output enabled */
/* LFSS_TOE15_12[TIO15] Bits */
#define LFSS_TOE15_12_TIO15_OFS                  (24)                            /* !< TIO15 Offset */
#define LFSS_TOE15_12_TIO15_MASK                 ((uint32_t)0x01000000U)         /* !< Enables data output for tamper I/O
                                                                                    15 */
#define LFSS_TOE15_12_TIO15_DISABLE              ((uint32_t)0x00000000U)         /* !< output disabled */
#define LFSS_TOE15_12_TIO15_ENABLE               ((uint32_t)0x01000000U)         /* !< output enabled */

