sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_lfss.h
/* LFSS_A1MIN Bits */
/* LFSS_A1MIN[AMINBIN] Bits */
#define LFSS_A1MIN_AMINBIN_OFS                   (0)                             /* !< AMINBIN Offset */
#define LFSS_A1MIN_AMINBIN_MASK                  ((uint32_t)0x0000003FU)         /* !< Alarm Minutes Binary (0 to 59). If
                                                                                    RTCBCD=1 write to these bits will be
                                                                                    ignored and read give the value 0. */
#define LFSS_A1MIN_AMINBIN_MINIMUM               ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_A1MIN_AMINBIN_MAXIMUM               ((uint32_t)0x0000003BU)         /* !< Highest possible value */
/* LFSS_A1MIN[AMINAEBIN] Bits */
#define LFSS_A1MIN_AMINAEBIN_OFS                 (7)                             /* !< AMINAEBIN Offset */
#define LFSS_A1MIN_AMINAEBIN_MASK                ((uint32_t)0x00000080U)         /* !< Alarm Minutes Binary enable. If
                                                                                    RTCBCD=1 this bit is always 0. Write
                                                                                    to this bit will be ignored.   0x0=
                                                                                    Alarm disabled.   0x1= Alarm enabled. */
#define LFSS_A1MIN_AMINAEBIN_DISABLE             ((uint32_t)0x00000000U)         /* !< No alarm */
#define LFSS_A1MIN_AMINAEBIN_ENABLE              ((uint32_t)0x00000080U)         /* !< Alarm enabled */
/* LFSS_A1MIN[AMINLOWBCD] Bits */
#define LFSS_A1MIN_AMINLOWBCD_OFS                (8)                             /* !< AMINLOWBCD Offset */
#define LFSS_A1MIN_AMINLOWBCD_MASK               ((uint32_t)0x00000F00U)         /* !< Alarm Minutes BCD  low digit (0 to
                                                                                    9). If RTCBCD=0 write to these bits
                                                                                    will be ignored and read give the
                                                                                    value 0. */
#define LFSS_A1MIN_AMINLOWBCD_MINIMUM            ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_A1MIN_AMINLOWBCD_MAXIMUM            ((uint32_t)0x00000900U)         /* !< Highest possible value */
/* LFSS_A1MIN[AMINHIGHBCD] Bits */
#define LFSS_A1MIN_AMINHIGHBCD_OFS               (12)                            /* !< AMINHIGHBCD Offset */
#define LFSS_A1MIN_AMINHIGHBCD_MASK              ((uint32_t)0x00007000U)         /* !< Alarm Minutes BCD  high digit (0 to
                                                                                    5). If RTCBCD=0 write to these bits
                                                                                    will be ignored and read give the
                                                                                    value 0. */
#define LFSS_A1MIN_AMINHIGHBCD_MINIMUM           ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_A1MIN_AMINHIGHBCD_MAXIMUM           ((uint32_t)0x00005000U)         /* !< Highest possible value */
/* LFSS_A1MIN[AMINAEBCD] Bits */
#define LFSS_A1MIN_AMINAEBCD_OFS                 (15)                            /* !< AMINAEBCD Offset */
#define LFSS_A1MIN_AMINAEBCD_MASK                ((uint32_t)0x00008000U)         /* !< Alarm Minutes BCD enable. If
                                                                                    RTCBCD=0 this bit is always 0. Write
                                                                                    to this bit will be ignored.   0x0=
                                                                                    Alarm disabled.   0x1= Alarm enabled. */
#define LFSS_A1MIN_AMINAEBCD_DISABLE             ((uint32_t)0x00000000U)         /* !< No alarm */
#define LFSS_A1MIN_AMINAEBCD_ENABLE              ((uint32_t)0x00008000U)         /* !< Alarm enabled */

/* LFSS_A1HOUR Bits */
/* LFSS_A1HOUR[AHOURBIN] Bits */
#define LFSS_A1HOUR_AHOURBIN_OFS                 (0)                             /* !< AHOURBIN Offset */
#define LFSS_A1HOUR_AHOURBIN_MASK                ((uint32_t)0x0000001FU)         /* !< Alarm Hours Binary (0 to 23). If
                                                                                    RTCBCD=1 write to these bits will be
                                                                                    ignored and read give the value 0. */
#define LFSS_A1HOUR_AHOURBIN_MINIMUM             ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_A1HOUR_AHOURBIN_MAXIMUM             ((uint32_t)0x00000017U)         /* !< Highest possible value */
/* LFSS_A1HOUR[AHOURAEBIN] Bits */
#define LFSS_A1HOUR_AHOURAEBIN_OFS               (7)                             /* !< AHOURAEBIN Offset */
#define LFSS_A1HOUR_AHOURAEBIN_MASK              ((uint32_t)0x00000080U)         /* !< Alarm Hours Binary enable. If
                                                                                    RTCBCD=1 this bit is always 0. Write
                                                                                    to this bit will be ignored.   0x0=
                                                                                    Alarm disabled.   0x1= Alarm enabled. */
#define LFSS_A1HOUR_AHOURAEBIN_DISABLE           ((uint32_t)0x00000000U)         /* !< No alarm */
#define LFSS_A1HOUR_AHOURAEBIN_ENABLE            ((uint32_t)0x00000080U)         /* !< Alarm enabled */
/* LFSS_A1HOUR[AHOURLOWBCD] Bits */
#define LFSS_A1HOUR_AHOURLOWBCD_OFS              (8)                             /* !< AHOURLOWBCD Offset */
#define LFSS_A1HOUR_AHOURLOWBCD_MASK             ((uint32_t)0x00000F00U)         /* !< Alarm Hours BCD  low digit (0 to
                                                                                    9). If RTCBCD=0 write to these bits
                                                                                    will be ignored and read give the
                                                                                    value 0. */
#define LFSS_A1HOUR_AHOURLOWBCD_MINIMUM          ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_A1HOUR_AHOURLOWBCD_MAXIMUM          ((uint32_t)0x00000900U)         /* !< Highest possible value */
/* LFSS_A1HOUR[AHOURHIGHBCD] Bits */
#define LFSS_A1HOUR_AHOURHIGHBCD_OFS             (12)                            /* !< AHOURHIGHBCD Offset */
#define LFSS_A1HOUR_AHOURHIGHBCD_MASK            ((uint32_t)0x00003000U)         /* !< Alarm Hours BCD  high digit (0 to
                                                                                    2). If RTCBCD=0 write to these bits
                                                                                    will be ignored and read give the
                                                                                    value 0.. */
#define LFSS_A1HOUR_AHOURHIGHBCD_MINIMUM         ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_A1HOUR_AHOURHIGHBCD_MAXIMUM         ((uint32_t)0x00002000U)         /* !< Highest possible value */
/* LFSS_A1HOUR[AHOURAEBCD] Bits */
#define LFSS_A1HOUR_AHOURAEBCD_OFS               (15)                            /* !< AHOURAEBCD Offset */
#define LFSS_A1HOUR_AHOURAEBCD_MASK              ((uint32_t)0x00008000U)         /* !< Alarm Hours BCD enable. If RTCBCD=0
                                                                                    this bit is always 0. Write to this
                                                                                    bit will be ignored.   0x0= Alarm
                                                                                    disabled.   0x1= Alarm enabled. */
#define LFSS_A1HOUR_AHOURAEBCD_DISABLE           ((uint32_t)0x00000000U)         /* !< No alarm */
#define LFSS_A1HOUR_AHOURAEBCD_ENABLE            ((uint32_t)0x00008000U)         /* !< Alarm enabled */

/* LFSS_A1DAY Bits */
/* LFSS_A1DAY[ADOW] Bits */
#define LFSS_A1DAY_ADOW_OFS                      (0)                             /* !< ADOW Offset */
#define LFSS_A1DAY_ADOW_MASK                     ((uint32_t)0x00000007U)         /* !< Alarm Day of week (0 to 6). These
                                                                                    bits are valid if RTCBCD=1 or
                                                                                    RTCBCD=0. */
#define LFSS_A1DAY_ADOW_MINIMUM                  ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_A1DAY_ADOW_MAXIMUM                  ((uint32_t)0x00000006U)         /* !< Highest possible value */
/* LFSS_A1DAY[ADOWAE] Bits */
#define LFSS_A1DAY_ADOWAE_OFS                    (7)                             /* !< ADOWAE Offset */
#define LFSS_A1DAY_ADOWAE_MASK                   ((uint32_t)0x00000080U)         /* !< Alarm Day of week enable. This bit
                                                                                    are valid if RTCBCD=1 or RTCBCD=0. */
#define LFSS_A1DAY_ADOWAE_DISABLE                ((uint32_t)0x00000000U)         /* !< No alarm */
#define LFSS_A1DAY_ADOWAE_ENABLE                 ((uint32_t)0x00000080U)         /* !< Alarm enabled */
/* LFSS_A1DAY[ADOMBIN] Bits */
#define LFSS_A1DAY_ADOMBIN_OFS                   (8)                             /* !< ADOMBIN Offset */
#define LFSS_A1DAY_ADOMBIN_MASK                  ((uint32_t)0x00001F00U)         /* !< Alarm Day of month Binary (1 to 28,
                                                                                    29, 30, 31) If RTCBCD=1 write to
                                                                                    these bits will be ignored and read
                                                                                    give the value 0. */
#define LFSS_A1DAY_ADOMBIN_MINIMUM               ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_A1DAY_ADOMBIN_MAXIMUM               ((uint32_t)0x00001F00U)         /* !< Highest possible value */
/* LFSS_A1DAY[ADOMAEBIN] Bits */
#define LFSS_A1DAY_ADOMAEBIN_OFS                 (15)                            /* !< ADOMAEBIN Offset */
#define LFSS_A1DAY_ADOMAEBIN_MASK                ((uint32_t)0x00008000U)         /* !< Alarm Day of month Binary enable.
                                                                                    If RTCBCD=1 this bit is always 0.
                                                                                    Write to this bit will be ignored.
                                                                                    0x0= Alarm disabled.   0x1= Alarm
                                                                                    enabled. */
#define LFSS_A1DAY_ADOMAEBIN_DISABLE             ((uint32_t)0x00000000U)         /* !< No alarm */
#define LFSS_A1DAY_ADOMAEBIN_ENABLE              ((uint32_t)0x00008000U)         /* !< Alarm enabled */
/* LFSS_A1DAY[ADOMLOWBCD] Bits */
#define LFSS_A1DAY_ADOMLOWBCD_OFS                (16)                            /* !< ADOMLOWBCD Offset */
#define LFSS_A1DAY_ADOMLOWBCD_MASK               ((uint32_t)0x000F0000U)         /* !< Alarm Day of month BCD  low digit
                                                                                    (0 to 9). If RTCBCD=0 write to these
                                                                                    bits will be ignored and read give
                                                                                    the value 0. */
#define LFSS_A1DAY_ADOMLOWBCD_MINIMUM            ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_A1DAY_ADOMLOWBCD_MAXIMUM            ((uint32_t)0x00090000U)         /* !< Highest possible value */
/* LFSS_A1DAY[ADOMHIGHBCD] Bits */
#define LFSS_A1DAY_ADOMHIGHBCD_OFS               (20)                            /* !< ADOMHIGHBCD Offset */
#define LFSS_A1DAY_ADOMHIGHBCD_MASK              ((uint32_t)0x00300000U)         /* !< Alarm Day of month BCD  high digit
                                                                                    (0 to 3). If RTCBCD=0 write to these
                                                                                    bits will be ignored and read give
                                                                                    the value 0. */
#define LFSS_A1DAY_ADOMHIGHBCD_MINIMUM           ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_A1DAY_ADOMHIGHBCD_MAXIMUM           ((uint32_t)0x00300000U)         /* !< Highest possible value */
/* LFSS_A1DAY[ADOMAEBCD] Bits */
#define LFSS_A1DAY_ADOMAEBCD_OFS                 (23)                            /* !< ADOMAEBCD Offset */
#define LFSS_A1DAY_ADOMAEBCD_MASK                ((uint32_t)0x00800000U)         /* !< Alarm Day of month BCD enable. If
                                                                                    RTCBCD=0 this bit is always 0. Write
                                                                                    to this bit will be ignored.   0x0=
                                                                                    Alarm disabled.   0x1= Alarm enabled. */
#define LFSS_A1DAY_ADOMAEBCD_DISABLE             ((uint32_t)0x00000000U)         /* !< No alarm */
#define LFSS_A1DAY_ADOMAEBCD_ENABLE              ((uint32_t)0x00800000U)         /* !< Alarm enabled */

/* LFSS_A2MIN Bits */
/* LFSS_A2MIN[AMINBIN] Bits */
#define LFSS_A2MIN_AMINBIN_OFS                   (0)                             /* !< AMINBIN Offset */
#define LFSS_A2MIN_AMINBIN_MASK                  ((uint32_t)0x0000003FU)         /* !< Alarm Minutes Binary (0 to 59). If
                                                                                    RTCBCD=1 write to these bits will be
                                                                                    ignored and read give the value 0. */
#define LFSS_A2MIN_AMINBIN_MINIMUM               ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_A2MIN_AMINBIN_MAXIMUM               ((uint32_t)0x0000003BU)         /* !< Highest possible value */
/* LFSS_A2MIN[AMINAEBIN] Bits */
#define LFSS_A2MIN_AMINAEBIN_OFS                 (7)                             /* !< AMINAEBIN Offset */
#define LFSS_A2MIN_AMINAEBIN_MASK                ((uint32_t)0x00000080U)         /* !< Alarm Minutes Binary enable. If
                                                                                    RTCBCD=1 this bit is always 0. Write
                                                                                    to this bit will be ignored.   0x0=
                                                                                    Alarm disabled.   0x1= Alarm enabled. */
#define LFSS_A2MIN_AMINAEBIN_DISABLE             ((uint32_t)0x00000000U)         /* !< No alarm */
#define LFSS_A2MIN_AMINAEBIN_ENABLE              ((uint32_t)0x00000080U)         /* !< Alarm enabled */
/* LFSS_A2MIN[AMINLOWBCD] Bits */
#define LFSS_A2MIN_AMINLOWBCD_OFS                (8)                             /* !< AMINLOWBCD Offset */
#define LFSS_A2MIN_AMINLOWBCD_MASK               ((uint32_t)0x00000F00U)         /* !< Alarm Minutes BCD  low digit (0 to
                                                                                    9). If RTCBCD=0 write to these bits
                                                                                    will be ignored and read give the
                                                                                    value 0. */
#define LFSS_A2MIN_AMINLOWBCD_MINIMUM            ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_A2MIN_AMINLOWBCD_MAXIMUM            ((uint32_t)0x00000900U)         /* !< Highest possible value */
/* LFSS_A2MIN[AMINHIGHBCD] Bits */
#define LFSS_A2MIN_AMINHIGHBCD_OFS               (12)                            /* !< AMINHIGHBCD Offset */
#define LFSS_A2MIN_AMINHIGHBCD_MASK              ((uint32_t)0x00007000U)         /* !< Alarm Minutes BCD  high digit (0 to
                                                                                    5). If RTCBCD=0 write to these bits
                                                                                    will be ignored and read give the
                                                                                    value 0. */
#define LFSS_A2MIN_AMINHIGHBCD_MINIMUM           ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_A2MIN_AMINHIGHBCD_MAXIMUM           ((uint32_t)0x00005000U)         /* !< Highest possible value */
/* LFSS_A2MIN[AMINAEBCD] Bits */
#define LFSS_A2MIN_AMINAEBCD_OFS                 (15)                            /* !< AMINAEBCD Offset */
#define LFSS_A2MIN_AMINAEBCD_MASK                ((uint32_t)0x00008000U)         /* !< Alarm Minutes BCD enable. If
                                                                                    RTCBCD=0 this bit is always 0. Write
                                                                                    to this bit will be ignored.   0x0=
                                                                                    Alarm disabled.   0x1= Alarm enabled. */
#define LFSS_A2MIN_AMINAEBCD_DISABLE             ((uint32_t)0x00000000U)         /* !< No alarm */
#define LFSS_A2MIN_AMINAEBCD_ENABLE              ((uint32_t)0x00008000U)         /* !< Alarm enabled */

/* LFSS_A2HOUR Bits */
/* LFSS_A2HOUR[AHOURBIN] Bits */
#define LFSS_A2HOUR_AHOURBIN_OFS                 (0)                             /* !< AHOURBIN Offset */
#define LFSS_A2HOUR_AHOURBIN_MASK                ((uint32_t)0x0000001FU)         /* !< Alarm Hours Binary (0 to 23). If
                                                                                    RTCBCD=1 write to these bits will be
                                                                                    ignored and read give the value 0. */
#define LFSS_A2HOUR_AHOURBIN_MINIMUM             ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_A2HOUR_AHOURBIN_MAXIMUM             ((uint32_t)0x00000017U)         /* !< Highest possible value */
/* LFSS_A2HOUR[AHOURAEBIN] Bits */
#define LFSS_A2HOUR_AHOURAEBIN_OFS               (7)                             /* !< AHOURAEBIN Offset */
#define LFSS_A2HOUR_AHOURAEBIN_MASK              ((uint32_t)0x00000080U)         /* !< Alarm Hours Binary enable. If
                                                                                    RTCBCD=1 this bit is always 0. Write
                                                                                    to this bit will be ignored.   0x0=
                                                                                    Alarm disabled.   0x1= Alarm enabled. */
#define LFSS_A2HOUR_AHOURAEBIN_DISABLE           ((uint32_t)0x00000000U)         /* !< No alarm */
#define LFSS_A2HOUR_AHOURAEBIN_ENABLE            ((uint32_t)0x00000080U)         /* !< Alarm enabled */
/* LFSS_A2HOUR[AHOURLOWBCD] Bits */
#define LFSS_A2HOUR_AHOURLOWBCD_OFS              (8)                             /* !< AHOURLOWBCD Offset */
#define LFSS_A2HOUR_AHOURLOWBCD_MASK             ((uint32_t)0x00000F00U)         /* !< Alarm Hours BCD  low digit (0 to
                                                                                    9). If RTCBCD=0 write to these bits
                                                                                    will be ignored and read give the
                                                                                    value 0. */
#define LFSS_A2HOUR_AHOURLOWBCD_MINIMUM          ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_A2HOUR_AHOURLOWBCD_MAXIMUM          ((uint32_t)0x00000900U)         /* !< Highest possible value */
/* LFSS_A2HOUR[AHOURHIGHBCD] Bits */
#define LFSS_A2HOUR_AHOURHIGHBCD_OFS             (12)                            /* !< AHOURHIGHBCD Offset */
#define LFSS_A2HOUR_AHOURHIGHBCD_MASK            ((uint32_t)0x00003000U)         /* !< Alarm Hours BCD  high digit (0 to
                                                                                    2). If RTCBCD=0 write to these bits
                                                                                    will be ignored and read give the
                                                                                    value 0.. */
#define LFSS_A2HOUR_AHOURHIGHBCD_MINIMUM         ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_A2HOUR_AHOURHIGHBCD_MAXIMUM         ((uint32_t)0x00002000U)         /* !< Highest possible value */
/* LFSS_A2HOUR[AHOURAEBCD] Bits */
#define LFSS_A2HOUR_AHOURAEBCD_OFS               (15)                            /* !< AHOURAEBCD Offset */
#define LFSS_A2HOUR_AHOURAEBCD_MASK              ((uint32_t)0x00008000U)         /* !< Alarm Hours BCD enable. If RTCBCD=0
                                                                                    this bit is always 0. Write to this
                                                                                    bit will be ignored.   0x0= Alarm
                                                                                    disabled.   0x1= Alarm enabled. */
#define LFSS_A2HOUR_AHOURAEBCD_DISABLE           ((uint32_t)0x00000000U)         /* !< No alarm */
#define LFSS_A2HOUR_AHOURAEBCD_ENABLE            ((uint32_t)0x00008000U)         /* !< Alarm enabled */

